## Production: web
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.aws_iam_policy_document.cra_upd_data_bucket_policy_doc will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cra_upd_data_bucket_policy_doc" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "mock_arn/documents/*",
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # data.aws_iam_policy_document.cra_upd_web_bucket_policy_doc will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "cra_upd_web_bucket_policy_doc" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "mock_arn/*",
            ]

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_cloudfront_cache_policy.cra_upd_api_cache_policy will be created
  + resource "aws_cloudfront_cache_policy" "cra_upd_api_cache_policy" {
      + arn         = (known after apply)
      + comment     = "The cache policy for the API Gateway origin"
      + default_ttl = 120
      + etag        = (known after apply)
      + id          = (known after apply)
      + max_ttl     = 31536000
      + min_ttl     = 0
      + name        = "cra_upd_api_cache_policy"

      + parameters_in_cache_key_and_forwarded_to_origin {
          + enable_accept_encoding_brotli = false
          + enable_accept_encoding_gzip   = true

          + cookies_config {
              + cookie_behavior = "none"
            }

          + headers_config {
              + header_behavior = "none"
            }

          + query_strings_config {
              + query_string_behavior = "all"
            }
        }
    }

  # aws_cloudfront_cache_policy.cra_upd_s3_cache_policy will be created
  + resource "aws_cloudfront_cache_policy" "cra_upd_s3_cache_policy" {
      + arn         = (known after apply)
      + comment     = "The cache policy for the S3 web bucket origin"
      + default_ttl = 300
      + etag        = (known after apply)
      + id          = (known after apply)
      + max_ttl     = 1200
      + min_ttl     = 1
      + name        = "cra_upd_s3_cache_policy"

      + parameters_in_cache_key_and_forwarded_to_origin {
          + enable_accept_encoding_brotli = true
          + enable_accept_encoding_gzip   = true

          + cookies_config {
              + cookie_behavior = "none"
            }

          + headers_config {
              + header_behavior = "none"
            }

          + query_strings_config {
              + query_string_behavior = "none"
            }
        }
    }

  # aws_cloudfront_function.cra_upd_cf_viewer_request_function will be created
  + resource "aws_cloudfront_function" "cra_upd_cf_viewer_request_function" {
      + arn             = (known after apply)
      + code            = <<-EOT
            /*
             * Cloudfront function to rewrite URLs for SPA routing.
             */
            
            var fileRegex = /^\/.+(\.\w+$)/; // matches paths requesting a file. e.g.: /route1/my-font.woff2
            
            function handler(event) {
              var request = event.request;
            
              if (!fileRegex.test(request.uri)) {
                request.uri = '/index.html';
              }
            
              return request;
            }
        EOT
      + comment         = "Rewrites URLs to enable SPA routing"
      + etag            = (known after apply)
      + id              = (known after apply)
      + live_stage_etag = (known after apply)
      + name            = "url-rewrite-function"
      + publish         = true
      + runtime         = "cloudfront-js-2.0"
      + status          = (known after apply)
    }

  # aws_cloudfront_origin_access_identity.origin_access_identity will be created
  + resource "aws_cloudfront_origin_access_identity" "origin_access_identity" {
      + arn                             = (known after apply)
      + caller_reference                = (known after apply)
      + cloudfront_access_identity_path = (known after apply)
      + comment                         = "Cloudfront origin access identity"
      + etag                            = (known after apply)
      + iam_arn                         = (known after apply)
      + id                              = (known after apply)
      + s3_canonical_user_id            = (known after apply)
    }

  # aws_s3_bucket_policy.cra_upd_data_bucket_policy will be created
  + resource "aws_s3_bucket_policy" "cra_upd_data_bucket_policy" {
      + bucket = "mock_id"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_policy.cra_upd_web_bucket_policy will be created
  + resource "aws_s3_bucket_policy" "cra_upd_web_bucket_policy" {
      + bucket = "mock_id"
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_wafv2_ip_set.cra_upd_waf_ip_set will be created
  + resource "aws_wafv2_ip_set" "cra_upd_waf_ip_set" {
      + addresses          = (sensitive value)
      + arn                = (known after apply)
      + description        = "CRA UPD IP address allow list"
      + id                 = (known after apply)
      + ip_address_version = "IPV4"
      + lock_token         = (known after apply)
      + name               = "cra-upd-waf-ip-set"
      + name_prefix        = (known after apply)
      + scope              = "CLOUDFRONT"
      + tags_all           = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "production"
          + "Terraform"   = "true"
        }
    }

  # aws_wafv2_web_acl.cra_upd_waf_acl will be created
  + resource "aws_wafv2_web_acl" "cra_upd_waf_acl" {
      + application_integration_url = (known after apply)
      + arn                         = (known after apply)
      + capacity                    = (known after apply)
      + description                 = "Block access from IPs not on the allowlist"
      + id                          = (known after apply)
      + lock_token                  = (known after apply)
      + name                        = "cra-upd-cloudfront-waf-acl"
      + name_prefix                 = (known after apply)
      + scope                       = "CLOUDFRONT"
      + tags_all                    = {
          + "CostCentre"  = "cra-upd-dashboard"
          + "Environment" = "production"
          + "Terraform"   = "true"
        }

      + default_action {
          + block {
            }
        }

      + rule {
          + name     = "AllowIpsFromAllowlist"
          + priority = 1

          + action {
              + allow {
                }
            }

          + statement {
              + ip_set_reference_statement {
                  + arn = (known after apply)
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "cra-upd-waf-cloudfront-allow-ips"
              + sampled_requests_enabled   = true
            }
        }

      + visibility_config {
          + cloudwatch_metrics_enabled = true
          + metric_name                = "cra-upd-waf-cloudfront-block-traffic"
          + sampled_requests_enabled   = true
        }
    }

Plan: 8 to add, 0 to change, 0 to destroy.
14:41:50.474 WARN   [../load_balancer] Config ../network/terragrunt.hcl is a dependency of ../load_balancer/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
14:41:50.480 WARN   [../load_balancer] Config ../route53/terragrunt.hcl is a dependency of ../load_balancer/terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
14:41:50.539 WARN   Config ../route53/terragrunt.hcl is a dependency of ./terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
14:41:51.561 WARN   Config ../load_balancer/terragrunt.hcl is a dependency of ./terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.
14:41:51.563 WARN   Config ../s3/terragrunt.hcl is a dependency of ./terragrunt.hcl that has no outputs, but mock outputs provided and returning those in dependency output.

Error: Invalid ARN Value

  with aws_cloudfront_vpc_origin.load_balancer_vpc_origin,
  on cloudfront.tf line 60, in resource "aws_cloudfront_vpc_origin" "load_balancer_vpc_origin":
  60:     arn                    = var.loadbalancer_arn

The provided value cannot be parsed as an ARN.

Path: vpc_origin_endpoint_config[0].arn
Value: 
14:41:56.439 ERROR  terraform invocation failed in ./.terragrunt-cache/ylEhn3LVLalJGWy2HtzxPYVjGh4/gyP3_ovh330wzQOVNUOW335QEDo/web
14:41:56.439 ERROR  error occurred:

* Failed to execute "terraform plan -input=false -out=plan.tfplan -no-color" in ./.terragrunt-cache/ylEhn3LVLalJGWy2HtzxPYVjGh4/gyP3_ovh330wzQOVNUOW335QEDo/web
  
  Error: Invalid ARN Value
  
    with aws_cloudfront_vpc_origin.load_balancer_vpc_origin,
    on cloudfront.tf line 60, in resource "aws_cloudfront_vpc_origin" "load_balancer_vpc_origin":
    60:     arn                    = var.loadbalancer_arn
  
  The provided value cannot be parsed as an ARN.
  
  Path: vpc_origin_endpoint_config[0].arn
  Value: 
  
  exit status 1


```

</details>

